## SQL을 사용하기 위한 setup

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///Weather.db

Regions table 에서 coastal이 Y인 state의 갯수를 되돌리는  SQL 프로그램을 작성하시오.

In [8]:
%%sql
Select COUNT(state)
From Regions
Where coastal='Y'

 * sqlite:///Weather.db
Done.

[(19,)]

## [학점취득용과제]

 CityTemps table을 lat의 내림차순으로 정렬하고 최상위 4개의 행만 출력하는 SQL 프로그램을 작성하시오.(모든 속성 출력)

In [6]:
%%sql
Select *
From CityTemps
order by lat desc
limit 4

 * sqlite:///Weather.db
Done.

[('Seattle', 'Washington', 48.1, 122.5, 45),
 ('Spokane', 'Washington', 48.1, 117.9, 31),
 ('Helena', 'Montana', 47.1, 112.4, 32),
 ('Bismarck', 'North Dakota', 47.1, 101.0, 24)]

## [학점취득용과제]

 CityTemps table을 lat의 내림차순으로 정렬하고 최하위 4개의 행만 출력하는 SQL 프로그램을 작성하시오.(모든 속성 출력)

In [31]:
%%sql
Select *
From CityTemps
order by lat desc
limit 50,54

 * sqlite:///Weather.db
Done.

[('Houston', 'Texas', 30.1, 95.9, 56),
 ('Galveston', 'Texas', 29.4, 95.5, 61),
 ('Miami', 'Florida', 26.3, 80.7, 70),
 ('Key West', 'Florida', 25.0, 82.0, 77)]